local cfg = {}

cfg.rent_factor = 0.1
cfg.sell_factor = 0.4

cfg.garage_types = {
  ["현대/기아"] = {
    _config = {vtype = "car"},
    ["morning"] = {"기아 모닝 2019", 13000000, ""},
    ["radi"] = {"대우 다마스", 11000000, ""},
    ["accent"] = {"엑센트", 15600000, ""},
    ["kiagt"] = {"스팅어 GT", 49000000, ""},
    ["veln"] = {"현대 벨로스터 N 2018", 35822000, ""},
    ["17avanad"] = {"현대 아반떼", 26000000, ""},
    ["18granig"] = {"현대 아제라 IG(그랜저 수출판)", 31000000, ""},
    ["14genedh"] = {"현대 제네시스 G380", 75000000, ""},
    ["genesis"] = {"현대 제네시스 쿠페", 35000000, ""},
    ["santafe"] = {"현대 싼타페", 39000000, ""},
    ["hkona"] = {"현대 코나 2018", 25000000, ""},
    ["sonata"] = {"현대 쏘나타 2018", 31000000, ""},
    ["jackal"] = {"기아 K5 SX", 36184000, ""},
    ["koup"] = {"기아 포르테", 30854000, ""},
    ["kiamansory"] = {"기아 스팅어 만소리튠", 68000000, ""},
    ["baller2"] = {"기아 스포티지 2017", 36180000, ""},
    ["equus"] = {"현대 에쿠스 리무진", 110000000, ""},
    ["carnival"] = {"기아 카니발 하이리무진", 56000000, ""},
    ["tuscani"] = {"현대 투스카니", 23000000, ""},
    ["sibal"] = {"시발차", 56000000, ""},
    ["starex"] = {"현대 스타렉스", 35000000, ""}
  },
  ["도요타/렉서스"] = {
    _config = {vtype = "car"},
    ["lc500"] = {"렉서스 LC500 2018", 172000000, ""},
    ["rx450h"] = {"렉서스 RX450H 2016", 89000000, ""},
    ["18rc350"] = {"렉서스 RC350", 61000000, ""},
    ["RC350"] = {"렉서스 RC350 튜닝", 75000000, ""},
    ["rcf"] = {"렉서스 RC F", 106000000, ""},
    ["gt86rb"] = {"도요타86 GTO", 85000000, ""},
    ["ae86"] = {"도요타 AE86", 16000000, ""},
    ["camry55"] = {"도요타 캠리 구형", 23000000, ""},
    ["cam8tun"] = {"도요타 캠리 튜닝", 36000000, ""},
    ["prius"] = {"도요타 프리우스", 16000000, ""},
    ["supra2"] = {"도요타 수프라", 26000000, ""}
  },
  ["BMW/미니"] = {
    _config = {vtype = "car"},
    ["17m760i"] = {"BMW M760i 2017", 230000000, ""},
    ["e46"] = {"BMW M3 E46 2005", 56000000, ""},
    ["z4"] = {"BMW Z4 컨버터블", 78000000, ""},
    ["19Z4"] = {"BMW Z4 2019", 82000000, ""},
    ["z4alchemist"] = {"BMW Z4 Alchemist", 105000000, ""},
    ["bmci"] = {"BMW M5", 132000000, ""},
    ["m5f90"] = {"BMW M5 신형", 145000000, ""},
    ["m850"] = {"BMW M850i", 218000000, ""},
    ["m8gte"] = {"BMW M8 GTE", 248000000, ""},
    ["bmwx7"] = {"BMW x7", 165000000, ""},
    ["m2"] = {"BMW M2 2016", 83000000, ""},
    ["e34touring"] = {"BMW E34 M5 투어링 1995", 92500000, ""},
    ["m3e46"] = {"BMW M3 E46 GTR", 105000000, ""},
    ["m4"] = {"BMW M4 2018", 105000000, ""},
    ["f82"] = {"BMW M4 F82", 110000000, ""},
    ["rmodm4gts"] = {"BMW M4 GTS 리버티워크", 160000000, ""},
    ["rmodm4"] = {"BMW M4 레이진바디킷", 145000000, ""},
    ["m6f13"] = {"BMW M6 그란쿠페", 180000000, ""},
    ["i8"] = {"BMW i8", 180000000, ""},
    ["rmodmi8"] = {"BMW i8 로드스터", 200000000, ""},
    ["mi8"] = {"BMW i8 MANSAUG", 230000000, ""},
    ["x5m"] = {"BMW X5M", 165000000, ""},
    ["x6m"] = {"BMW X6M F16", 183000000, ""},
    ["m5f90"] = {"BMW M5 F90 리버티워크", 250000000, ""},
    ["cooperworks"] = {"미니 쿠퍼 JCW", 52000000, ""},
    ["cooper15"] = {"미니 쿠퍼 S 2015", 45000000, ""},
    ["cooperworks"] = {"미니 쿠퍼 S 로드스터", 48000000, ""}
  },
  ["벤츠"] = {
    _config = {vtype = "car"},
    ["cls2015"] = {"벤츠 CLS63 AMG", 180000000, ""},
    ["g63"] = {"벤츠 G63 AMG", 250000000, ""},
    ["g65amg"] = {"벤츠 G65 AMG", 320000000, ""},
    ["gclas9"] = {"벤츠 G클래스 2019", 150000000, ""},
    ["amggtr"] = {"벤츠 AMG GTR 2018", 280000000, ""},
    ["gt63s"] = {"벤츠 AMG GT63S", 260000000, ""},
    ["amggtsmansory"] = {"벤츠 AMG GTR 만소리", 350000000, ""},
    ["slsamg"] = {"벤츠 SLS AMG", 300000000, ""},
    ["s6brabus"] = {"벤츠 브라부스 S6", 380000000, ""},
    ["b63s"] = {"벤츠 B63s 브라부스", 160000000, ""},
    ["c63w205"] = {"벤츠 C63 AMG S 2017", 120000000, ""},
    ["c63coupe"] = {"벤츠 C63 AMG S 쿠페", 115000000, ""},
    ["18mbs650"] = {"벤츠 마이바흐 S650 2018", 260000000, ""},
    ["s500w222"] = {"벤츠 S500 W222", 150000000, ""},
    ["s600w220"] = {"벤츠 S600 W220", 180000000, ""},
    ["11sprinter"] = {"벤츠 스프린터 2011", 90000000, ""},
    ["gl63"] = {"벤츠 GL63 AMG", 145000000, ""},
    ["gle"] = {"벤츠 AMG GLE", 160000000, ""},
    ["mers63c"] = {"벤츠 S63 AMG 카브리올레", 210000000, ""},
    ["c63a"] = {"벤츠 AMG C63", 100000000, "W204"},
    ["macla"] = {"벤츠 A 클래스 2019", 39000000, ""},
    ["ae350"] = {"벤츠 E350 블루텍", 68000000, ""},
    ["mb250"] = {"벤츠 V250 2019", 95000000, ""},
    ["gle63s"] = {"벤츠 GLE63s AMG 2016", 180000000, ""},
    ["amggtsprior"] = {"벤츠 AMG GT S 프리어 에디션", 320000000, ""}
  },
  ["아우디/폭스바겐"] = {
    _config = {vtype = "car"},
    ["r820"] = {"아우디 R8 2020", 265000000, ""},
    ["r8v10"] = {"아우디 R8 2018", 249000000, ""},
    ["r8ppi"] = {"아우디 R8 PPI 2015", 230000000, ""},
    ["r8lms"] = {"아우디 R8 LMS", 350000000, ""},
    ["rs6"] = {"아우디 RS6", 130000000, ""},
    ["sentinel"] = {"아우디 S5", 95000000, ""},
    ["tts"] = {"아우디 TTS 2015", 65000000, ""},
    ["aaq4"] = {"아우디 A4 콰트로 ABT 2017", 55000000, ""},
    ["rs7"] = {"아우디 RS7", 185000000, ""},
    ["a8l"] = {"아우디 S8", 190000000, ""},
    ["sq72016"] = {"아우디 SQ7 2016", 110000000, ""},
    ["rs52018"] = {"아우디 RS5 2018", 87000000, ""},
    ["a6tfsi"] = {"아우디 A6 55 TFSI 콰트로 S 라인 2019", 76000000, ""},
    ["audiq8"] = {"아우디 Q8 2019", 105000000, ""},
    ["AUDsq517"] = {"아우디 SQ5 2017", 85000000, ""},
    ["rs318"] = {"아우디 RS3 스포츠 백 2018", 65000000, ""},
    ["golfp"] = {"폭스바겐 골프 R Mk7", 52000000, ""}
  },
  ["벤틀리"] = {
    _config = {vtype = "car"},
    ["17bcs"] = {"벤틀리 콘티넨탈 GT 슈퍼스포츠", 210000000, ""},
    ["bnteam"] = {"벤틀리 콘티넨탈 GT 인디오더", 250000000, ""},
    ["bcgt"] = {"벤틀리 콘티넨탈 GT 컨버터블 2014", 260000000, ""},
    ["bentaygast"] = {"벤틀리 벤테이가 테크 2017", 380000000, ""},
    ["brooklands"] = {"벤틀리 브룩 2008", 391600000, ""},
    ["bbentayga"] = {"벤틀리 벤테이가", 384400000, ""},
    ["bexp"] = {"벤틀리 EXP", 650000000, ""},
    ["bmm"] = {"벤틀리 뮬산 뮬리너", 520000000, ""}
  },
  ["맥라렌"] = {
    _config = {vtype = "car"},
    ["720s"] = {"맥라렌 720s", 370000000, ""},
    ["mv720"] = {"맥라렌 720s 볼스테이너 2018", 490000000, ""},
    ["675lt"] = {"맥라렌 675LT 쿠페 2016", 320000000, ""},
    ["570s2"] = {"맥라렌 570S 2015", 250000000, ""},
    ["p1"] = {"맥라렌 P1", 1800000000, ""},
    ["p1gtr"] = {"맥라렌 P1 GTR", 2500000000, ""},
    ["mp412c"] = {"맥라렌 MP4-12C", 300000000, ""},
    ["senna"] = {"맥라렌 세나 2019", 2500000000, ""},
    ["600lt"] = {"맥라렌 600LT", 300000000, ""}
  },
  ["포르쉐"] = {
    _config = {vtype = "car"},
    ["911turbos"] = {"포르쉐 911 터보 S 쿠페", 320000000, ""},
    ["911tbs"] = {"포르쉐 911 터보 S 카브리올레", 300000000, ""},
    ["pcs18"] = {"포르쉐 카이엔 S 2018", 135000000, ""},
    ["cayenne"] = {"포르쉐 카이엔 S 터보", 172000000, ""},
    ["718caymans"] = {"포르쉐 718 카이맨 S", 120000000, ""},
    ["718boxster"] = {"포르쉐 718 박스터 S", 125000000, ""},
    ["panamera17turbo"] = {"포르쉐 파나 메라 터보 2017", 250000000, ""},
    ["918"] = {"포르쉐 918 스파이더 2015", 1800000000, ""},
    ["p901"] = {"포르쉐 911 (964) Targa & Cabrio 1965", 380000000, ""},
    ["cayman16"] = {"포르쉐 카이맨GT4 2016", 150000000, ""},
    ["por911gt3"] = {"포르쉐 911 GT3", 200000000, ""},
    ["GT2RS"] = {"포르쉐 911 GT2 RS", 380000000, ""},
    ["993rwb"] = {"포르쉐 993 RWB", 250000000, ""},
    ["911r"] = {"포르쉐 911R", 1150000000, ""},
    ["cgt"] = {"포르쉐 카레라 GT 2006", 950000000, ""},
    ["pm19"] = {"포르쉐 마칸 터보", 138000000, ""},
    ["str20"] = {"포르쉐 911 스피드스터", 165000000, ""},
    ["pgt3"] = {"포르쉐 911 GT3 RS", 230000000, ""}
  },
  ["페라리"] = {
    _config = {vtype = "car"},
    ["fct"] = {"페라리 캘리포니아 T 2015", 350000000, ""},
    ["f40"] = {"페라리 F40", 280000000, ""},
    ["f430s"] = {"페라리 F430 스쿠데리아", 250000000, ""},
    ["ferporto"] = {"페라리 포르토피노 2018", 380000000, ""},
    ["fer612"] = {"페라리 612 스카글레이터 2004", 350000000, ""},
    ["yfe458i1"] = {"페라리 458 이탈리아", 400000000, ""},
    ["yfe458s1"] = {"페라리 458 스파이더", 410000000, ""},
    ["lw458s"] = {"페라리 458 스파이더 리버티워크", 415000000, ""},
    ["4881"] = {"페라리 488 GTB", 420000000, ""},
    ["f8t"] = {"페라리 F8 트리뷰토", 425000000, ""},
    ["gtc4"] = {"페라리 GTC4", 480000000, ""},
    ["yfe458s2"] = {"페라리 458 스페치알레 A", 530000000, ""},
    ["yfe458i2"] = {"페라리 458 스페치알레", 520000000, ""},
    ["pista"] = {"페라리 488 피스타", 560000000, ""},
    ["pistas"] = {"페라리 488 피스타 스파이더", 610000000, ""},
    ["fm488"] = {"페라리 488 만소리 시라쿠사", 480000000, ""},
    ["berlinetta"] = {"페라리 F12 베를리네타", 620000000, ""},
    ["gtoxx"] = {"페라리 599 GTO", 650000000, ""},
    ["ferrari812"] = {"페라리 812 슈퍼패스트", 680000000, ""},
    ["f12m"] = {"페라리 F12 만소리", 720000000, ""},
    ["aperta"] = {"페라리 라페라리 아페르타", 3500000000, ""},
    ["enzo"] = {"페라리 엔초", 3200000000, ""},
    ["scuderiag"] = {"페라리 스쿠데리아 글리켄하어스", 8600000000, ""},
    ["f60"] = {"페라리 F60 아메리카", 3600000000, ""},
    ["nlargo"] = {"페라리 F12 N-Largo", 560000000, ""},
    ["sergio"] = {"페라리 세르지오", 350000000, ""}
  },
  ["람보르기니"] = {
    _config = {vtype = "car"},
    ["lp770"] = {"람보르기니 센테나리오", 3500000000, ""},
    ["cyclone"] = {"람보르기니 센테나리오 로드스터", 3800000000, ""},
    ["lp700r"] = {"람보르기니 아벤타도르", 680000000, ""},
    ["lp670"] = {"람보르기니 무르시엘라고 슈퍼벨로체", 380000000, ""},
    ["aventadors"] = {"람보르기니 아벤타도르S", 710000000, ""},
    ["rmodlp750"] = {"람보르기니 아벤타도르 슈퍼벨로체", 730000000, ""},
    ["lb750sv"] = {"람보르기니 아벤타도르 슈퍼벨로체", 750000000, "리버티워크"},
    ["lamboavj"] = {"람보르기니 아벤타도르SVJ", 780000000, ""},
    ["lp610"] = {"람보르기니 우라칸 스파이더", 420000000, ""},
    ["500gtrlam"] = {"람보르기니 디아블로 GTR", 367380000, ""},
    ["610lb"] = {"람보르기니 우라칸", 431872000, "리버티워크"},
    ["huraperfospy"] = {"람보르기니 우라칸 스파이더 퍼포만테", 450000000, ""},
    ["lbperfs"] = {"람보르기니 우라칸 스파이더 퍼포만테 리버티워크", 471872000, ""},
    ["rmodlp570"] = {"람보르기니 가야르도", 340000000, ""},
    ["gallardosuperlb"] = {"람보르기니 가야르도 슈퍼벨로체", 380000000, ""},
    ["urus2018"] = {"람보르기니 우루스 2018", 280000000, ""},
    ["lambose"] = {"람보르기니 세스토엘레멘토", 3512785800, ""},
    ["huracanst"] = {"람보르기니 우라칸ST", 480000000, ""},
    ["sc18"] = {"람보르기니 SC18 알스톤", 1530000000, ""}
  },
  ["재규어"] = {
    _config = {vtype = "car"},
    ["p7"] = {"재규어 프로젝트7", 239528400, ""},
    ["xkgt"] = {"재규어 XKR-S GT 2015", 260000000, ""},
    ["ipace"] = {"재규어 I-페이스 2016", 130000000, ""},
    ["fpacehm"] = {"재규어 F-페이스 하만", 150000000, ""}
  },
  ["기타"] = {
    _config = {vtype = "car"},
    ["mbh"] = {"마이바흐 62S 제플린", 925000000, ""},
    ["twizy"] = {"르노 트위지", 16500000, ""},
    ["tmax"] = {"T Express", 9500000, ""},
    ["gtx"] = {"플리머스 GTX 1971", 250000000, ""},
    ["nanoflo"] = {"NanoFlowcell Quantino", 230000000, ""},
    ["shotaro"] = {"나가사키 쇼타로", 35000000, ""},
    ["firebird"] = {"폰티악 파이어 버드 1970", 56000000, ""},
    ["saleens7"] = {"살룬 S7 2002", 1450000000, ""},
    ["slingshot"] = {"폴라리스 슬링샷 2015", 30000000, ""},
    ["cox2013"] = {"폭스바겐 비틀 COX 2013", 40000000, ""},
    ["can"] = {"캔암 메버릭", 20000000, ""},
    ["1949coupe"] = {"머큐리 1949 쿠페 ", 60000000, ""}
  },
  ["포드/캐딜락/닷지"] = {
    _config = {vtype = "car"},
    ["focusrs"] = {"포드 포커스 RS", 51000000, ""},
    ["mst"] = {"포드 머스탱GT NFS 2013", 75000000, ""},
    ["20f250"] = {"포드 F-250 슈퍼듀티 2020", 105000000, ""},
    ["18f250"] = {"포드 F-250 XLT 슈퍼 2018", 105000000, ""},
    ["mgt"] = {"포드 머스탱 GT", 50000000, ""},
    ["gt17"] = {"포드 GT 2017", 650000000, ""},
    ["demon"] = {"닷지 챌린저 SRT 악마 2018", 65000000, ""},
    ["durango"] = {"닷지 두랑고 SRT 2018", 56000000, ""},
    ["cats"] = {"캐딜락 ATS-V 쿠페 2016", 110000000, ""},
    ["ct6"] = {"캐딜락 CT6", 108000000, ""},
    ["srt8"] = {"지프 SRT8", 93000000, ""},
    ["demonhawk"] = {"지프 악마호크", 85000000, ""},
    ["gmcyd"] = {"GMC 유콘 데날리 2015", 85000000, ""}
  },
  ["혼다"] = {
    _config = {vtype = "car"},
    ["ap2"] = {"혼다 S2000 로드스터", 21000000, ""},
    ["crz"] = {"혼다 CRZ", 15000000, ""},
    ["fk8"] = {"혼다 시빅R", 35000000, ""},
    ["goldwing"] = {"혼다 GL1800 골드윙 2018", 37074900, ""},
    ["nobike"] = {"혼다 웨이브 125i 2010", 23000000, ""},
    ["na1"] = {"혼다 NSX-R (NA1) 1992", 13200000, ""},
    ["nc1"] = {"혼다 미드쉽", 76000000, ""},
    ["ody18"] = {"혼다 오딧세이", 43200000, ""}
  },
  ["롤스로이스"] = {
    _config = {vtype = "car"},
    ["Wraith"] = {"롤스로이스 레이스", 450000000, ""},
    ["cullinan"] = {"롤스로이스 컬리넌 2019", 520000000, ""},
    ["rrphantom"] = {"롤스로이스 팬텀", 720000000, ""},
    ["rdawn"] = {"롤스로이스 던 만소리", 630000000, ""}
  },
  ["테슬라"] = {
    _config = {vtype = "car"},
    ["p90d"] = {"테슬라 모델 S P90d", 150000000, ""},
    ["models"] = {"테슬라 모델 S 2016", 156000000, ""},
    ["14models"] = {"테슬라 모델 S 2014", 196000000, ""},
    ["teslapd"] = {"테슬라 모델 X", 135000000, ""},
    ["tr22"] = {"테슬라 로드스터 2020", 250000000, ""}
  },
  ["쉐보레"] = {
    _config = {vtype = "car"},
    ["malibu"] = {"쉐보레 말리부 2018", 36620000, ""},
    ["exor"] = {"쉐보레 카마로 ZL1 2017", 120000000, ""},
    ["c7"] = {"쉐보레 콜벳 C7 2014", 115000000, ""},
    --오류차량 ["c8"] = {"쉐보레 콜벳 C8 스팅레이 2020", 135000000, ""},
    ["2020ss"] = {"쉐보레 카마로SS", 56000000, ""},
    ["c7r"] = {"쉐보레 콜벳 C7R", 125000000, ""}
  },
  ["마세라티"] = {
    _config = {vtype = "car"},
    ["ghis2"] = {"마세라티 기블리", 98000000, ""},
    ["mqgts"] = {"마세라티 콰트로포르테", 210000000, ""},
    ["granlb"] = {"마세라티 그란투리스모 MC 튜닝", 310000000, ""},
    ["mlmansory"] = {"마세라티 르반떼", 150000000, ""}
  },
  ["애스턴마틴"] = {
    _config = {vtype = "car"},
    ["vantage"] = {"애스턴마틴 밴티지 2019", 235000000, ""},
    ["db11"] = {"애스턴마틴 DB11", 292000000, ""},
    ["cyrus"] = {"애스턴마틴 DB11 키루스", 320000000, ""},
    ["ast"] = {"애스턴마틴 뱅퀴시", 385000000, ""},
    ["one77"] = {"애스턴마틴 One-77", 2400000000, ""},
    ["vulcan"] = {"애스턴마틴 벌칸", 4500000000, ""}
  },
  ["닛산"] = {
    _config = {vtype = "car"},
    --["180sx"] = {"닛산 180sx", 15000000, ""},
    ["d1r34"] = {"닛산 R34", 16000000, ""},
    ["gtr"] = {"닛산 GTR 2017", 165000000, ""},
    ["nissantitan17"] = {"닛산 타이탄 픽업트럭", 55000000, ""},
    ["skyline"] = {"닛산 스카이라인", 25000000, ""},
    ["17ARMADA"] = {"닛산 아르마다 2017", 28000000, ""},
    ["gt86rb"] = {"도요타86 GTO", 85000000, ""}
  },
  ["볼보"] = {
    _config = {vtype = "car"},
    ["vv60"] = {"볼보 V60 2019", 48000000, ""},
    ["xc90r"] = {"볼보 XC90 R 2018", 98000000, ""}
  },
  ["랜드로버"] = {
    _config = {vtype = "car"},
    ["18Velar"] = {"레인지로버 벨라 2017", 125000000, ""},
    ["rr12"] = {"레인지로버 2010", 240000000, ""},
    ["rrstart"] = {"레인지로버 보그 테크 L405", 280000000, ""},
    ["svr16"] = {"레인지로버 스포츠 SVR", 320000000, ""}
  },
  ["헤네시"] = {
    _config = {vtype = "car"},
    ["exor"] = {"헤네시 카마로 엑소시스트 ZL1", 115000000, ""},
    ["velociraptor"] = {"헤네시 F-150 벨로시랩터", 180000000, ""},
    ["xnsgt"] = {"헤네시 베놈 GT", 650000000, ""}
  },
  ["바이크"] = {
    _config = {vtype = "bike"},
    ["f4rr"] = {"아구스타 F4 RR", 32000000, ""},
    ["snowbike"] = {"스노우 바이크", 12000000, ""},
    ["tronb"] = {"트론 바이크", 90000000, ""},
    ["bagger"] = {"베이거", 7000000, ""},
    ["bati"] = {"바티 801", 10000000, ""},
    ["bati2"] = {"바티 801RR", 10000000, ""},
    ["bf400"] = {"BF400", 6000000, ""},
    ["65bmwb"] = {"BMW R75 바버 1965", 10000000, ""},
    ["carbonrs"] = {"카본 RS", 11000000, ""},
    ["cliffhanger"] = {"클리프행거", 13000000, ""},
    ["f131"] = {"컨페더레이트 F131 헬켓", 45000000, ""},
    ["double"] = {"더블 T", 9000000, ""},
    ["enduro"] = {"엔듀로", 6000000, ""},
    ["gargoyle"] = {"가고일", 10000000, ""},
    ["hakuchou"] = {"하쿠초우", 20000000, ""},
    ["halyb"] = {"할리 데이비슨", 20000000, ""},
    ["hexer"] = {"헥서", 15000000, ""},
    ["innovation"] = {"이노베이션", 20000000, ""},
    ["pcj"] = {"PCJ-600", 7000000, ""},
    ["sanchez"] = {"산체스", 3000000, ""},
    ["sovereign"] = {"소버린", 1000000, ""},
    ["vader"] = {"베이더", 7000000, ""},
    ["vindicator"] = {"빈디케이터", 12000000, ""},
    ["bs17"] = {"BMW S1000RR", 21000000, ""},
    ["panigale"] = {"두카티 파니갈레 R 1299", 35000000, ""}
  },
  ["자전거"] = {
    _config = {vtype = "bike"},
    ["fixter"] = {"픽시 자전거", 150000, ""},
    ["tribike"] = {"로드 자전거", 280000, ""},
    ["bmx"] = {"BMX 자전거", 250000, ""},
    ["scorcher"] = {"MTB 자전거", 230000, ""}
  },
  ["부가티"] = {
    _config = {vtype = "car"},
    ["bugatti"] = {"부가티 베이론", 3200000000, ""},
    ["supersport"] = {"부가티 베이론 슈퍼스포트", 3250000000, ""},
    ["2017chiron"] = {"부가티 시론", 3800000000, ""},
    ["bdivo"] = {"부가티 디보", 6200000000, ""}
  },
  ["파가니"] = {
    _config = {vtype = "car"},
    ["tricolore"] = {"파가니 존다 R", 2500000000, ""},
    ["huayrar"] = {"파가니 후아이라 로드스터", 1800000000, ""},
    ["bc"] = {"파가니 후아이라 BC", 2300000000, ""}
  },
  ["W모터스"] = {
    _config = {vtype = "car"},
    ["lykan"] = {"W모터스 라이칸 하이퍼스포츠", 4120000000, ""},
    ["fenyr"] = {"W모터스 페니어 하이퍼스포츠", 4500000000, ""}
  },
  ["코닉세그"] = {
    _config = {vtype = "car"},
    ["acsr"] = {"코닉세그 아제라 R", 2500000000, ""},
    ["regera"] = {"코닉세그 레제라", 2800000000, ""}
  },
  ["포뮬러"] = {
    _config = {vtype = "car"},
    ["brabhan67"] = {"F2", 8900000000, ""},
    ["f248"] = {"페라리 F248", 16000000000, ""},
    ["formulaA"] = {"F1", 11500000000, ""},
    ["l78c"] = {"로터스78", 13000000000, ""},
    ["redbullx1"] = {"레드불", 15000000000, ""}
  },
  ["관리자 차량"] = {
    _config = {permissions = {"admin.vehicle"}},
    ["ssc"] = {"SSC 얼티밋 에어로", 0, ""},
    ["kart"] = {"*카트", 0, ""},
    ["superkart"] = {"*슈퍼 카트 ", 0, ""},
    ["RRazirrisa"] = {"롤스로이스 스페셜", 0, ""},
    ["2018transam"] = {"트랜스 앰", 0, ""},
    ["dawnbb"] = {"롤스로이스 던 블랙배지", 0, ""},
    ["dawnnovitec"] = {"롤스로이스 던 노비텍", 0, ""},
    ["dawnonyx"] = {"롤스로이스 던 ONYX", 0, ""},
    ["gr1"] = {"토마호크 비전 그란투리스모 GR.1", 0, ""},
    ["lhfjyhjck"] = {"레인지로버 보그 리무진", 0, ""},
    ["mansorys"] = {"벤츠 E클래스 만소리", 0, ""},
    ["pocky"] = {"포키", 0, ""},
    ["na6"] = {"na6", 0, ""},
    ["ns15rb"] = {"ns15rb", 0, ""},
    ["rrghost18blackbw"] = {"롤스로이스 고스트 블랙배지", 0, ""},
    ["turismorrod"] = {"그로티 투리스모 R 로드스터", 0, ""},
    ["yMetalSlugNew"] = {"메탈슬러그 탱크", 0, ""},
    ["jingdouyun"] = {"근두운", 0, ""},
    ["nimbus2000"] = {"마법 빗자루", 0, ""},
    ["zyj"] = {"마법이 깃든 검", 0, ""},
    ["moj"] = {"신의 검", 0, ""}
  },
  ["트럭 차고"] = {
    _config = {vtype = "car", blipid = 477, blipcolor = 5},
    ["SS730"] = {"스카니아 2014 S730", 100000000, ""},
    ["man"] = {"MAN TGX V8 6x4", 80000000, ""},
    ["actros"] = {"벤츠 악트로스 4x4", 100000000, ""}
  },
  ["다이소직원 차고"] = {
    _config = {vtype = "car", permissions = {"daiso.vehicle"}},
    ["bongo"] = {"기아 봉고3 카고트럭", 25000000, ""},
    ["porter"] = {"현대 포터2 카고트럭", 35000000, ""},
    ["porter2"] = {"현대 포터2 탑차", 50000000, ""}
  },
  ["렉카 차고"] = {
    _config = {vtype = "car", permissions = {"gm.vehicle"}},
    ["flatbed3"] = {"렉카 플랫베드", 150000000, ""}
  },
  ["경찰차"] = {
    _config = {vtype = "car", permissions = {"policer.vehicle"}},
    ["polad"] = {"[01] 현대 아반떼AD 경찰차", 0, ""},
    ["polsnt"] = {"[02] 현대 LF쏘나타 경찰차", 0, ""},
    ["dn8polices"] = {"[03] 현대 쏘나타 DN8 경찰차", 10000000, ""},
    ["polts"] = {"[04] 현대 투싼 경찰차", 20000000, ""},
    ["pstarex"] = {"[05] 현대 스타렉스 경찰차", 35000000, ""},
    ["unsont"] = {"[06] 현대 쏘나타 암행순찰차", 50000000, ""},
    ["g70police"] = {"[07] 현대 제네시스 G70 암행순찰차", 80000000, ""},
    ["polkias"] = {"[08] 기아 스팅어 경찰차", 80000000, ""},
    ["bmpos8"] = {"[09] BMW M3 F80 경찰차", 100000000, ""},
    ["r1200rtp"] = {"[10] 경찰 싸이카 오토바이", 120000000, ""},
    ["polamggtr"] = {"[11] 벤츠 AMG GTS 경찰차", 200000000, ""},
    ["polaventa"] = {"[12] 람보르기니 아벤타도르 경찰차", 500000000, ""},
    ["p1police"] = {"[13] 멕라렌 P1 경찰차", 520000000, ""},
    ["polzonda1"] = {"[14] 파가니 존다 버전 1 경찰차", 550000000, ""},
    ["polzonda2"] = {"[15] 파가니 존다 버전 2 경찰차", 550000000, ""},
    ["polchirons"] = {"[16] 부가티 시론 경찰차", 700000000, ""},
    ["wmfenyrcops"] = {"[17] W모터스 페니어 경찰차", 1200000000, ""},
    ["protopolice"] = {"[18] 리얼월드 스페셜 경찰차", 2000000000, ""},
    ["r1custom"] = {"[19] 경찰 고급 바이크", 0, ""},
    ["fbi2"] = {"[특수] 경찰 SAWT 방탄승합", 0, ""},
    ["insurgent"] = {"[특수] 경찰 SWAT 대공전차", 3000000000, ""}
  },
  ["경찰보트"] = {
    _config = {vtype = "car", permissions = {"policer.vehicle"}},
    ["predator"] = {"[01] 경찰 프레데터 보트", 0, ""}
  },
  ["교정본부 헬기"] = {
    _config = {vtype = "car", permissions = {"kys.vehicle"}},
    ["valkyrie2"] = {"경찰/교정 헬리콥터 발키리", 0, ""},
    ["whitehawk"] = {"교정본부 일반 헬리콥터", 0, ""},
    ["ksyheli01"] = {"교정본부 긴급호송 헬리콥터", 500000000, ""}
  },
  ["구급차"] = {
    _config = {vtype = "car", permissions = {"emergency.vehicle"}},
    --["ambulance"] = {"[EMS]엠뷸런스", 0, ""},
    ["astarex"] = {"*현대 스타렉스 EMS 구급차", 0, ""},
    ["astarex3"] = {"현대 스타렉스 하이루프 EMS 구급차", 5000000, ""},
    ["astarex2"] = {"현대 스타렉스 EMS 환자이송차", 10000000, ""},
    ["firetruk"] = {"EMS 소방차", 10000000, ""},
    ["dn8ems"] = {"현대 쏘나타 DN8 EMS 세단", 15000000, ""},
    ["g70m"] = {"현대 제네시스 G70 EMS 스포츠세단", 25000000, ""},
    ["emsamggtr"] = {"벤츠 AMG GTS EMS 스포츠카", 70000000, ""},
    ["emsgt17"] = {"포드 GT 17 EMS 스포츠카", 70000000, ""},
    ["remsx5"] = {"BMW X5 EMS SUV", 100000000, ""},
    ["remsv"] = {"볼보 XC60 EMS SUV", 120000000, ""},
    ["emsfsc"] = {"페라리 스쿠데리아 EMS EMS 스포츠카", 150000000, ""},
    ["emszonda"] = {"파가니 존다 EMS 스포츠카", 200000000, ""},
    ["polrs"] = {"르노 스포츠 EMS 스포츠카", 250000000, ""},
    ["emsaventa"] = {"람보르기니 아벤타도르 EMS 스포츠카", 300000000, ""},
    ["remszen"] = {"람보르기니 센테나리오 EMS 스포츠카", 500000000, ""},
    ["remsve"] = {"람보르기니 베네노 EMS 스포츠카", 700000000, ""},
    ["polp1ems"] = {"멕라렌 P1 EMS 스포츠카", 1000000000, ""},
    ["emschiron"] = {"부가티 시론 EMS 스포츠카", 1200000000, ""},
    ["wmfenyrems3"] = {"W모터스 페니어 EMS 하이퍼카", 1500000000, ""}
    --["dodgeEMS"] = {"닷지 EMS", 0, ""},
    --["police3"] = {"포드 EMS", 0, ""},
    --["db11ems"] = {"애스턴마틴 DB11 EMS", 0, ""},
    --["polgs350"] = {"렉서스 GS350", 0, ""},
    --["pol718"] = {"포르쉐 718 EMS", 0, ""},
    --["pol458"] = {"페라리 458 EMS", 0, ""},
    --["nypdexplorer"] = {"[0]포드 익스플로러 시험용차", 0, ""}
  },
  ["교정본부차고"] = {
    _config = {vtype = "car", permissions = {"kys.vehicle"}},
    ["g70a"] = {"교정본부 G70 공무", 50000000, ""},
    ["ksycar01"] = {"교정본부 벤츠 스프린터 긴급호송밴", 100000000, ""},
    ["ksycar02"] = {"교정본부 긴급호송 버스", 150000000, ""}
  },
  ["경찰 헬기"] = {
    _config = {vtype = "car", blipid = 43, blipcolor = 38, radius = 5.1, permissions = {"police.vehicle"}},
    ["valkyrie2"] = {"경찰/교정 헬리콥터 발키리", 0, ""},
    ["polmav"] = {"경찰 헬리콥터(로프)", 0, ""}
  },
  ["EMS 헬기"] = {
    _config = {vtype = "car", blipid = 43, blipcolor = 1, radius = 5.1, permissions = {"emergency.vehicle"}},
    ["supervolito"] = {"EMS 슈퍼볼리토 헬리콥터", 0, ""},
    ["maverick"] = {"EMS 메버릭 헬리콥터", 0, ""},
    ["firehawk"] = {"EMS 닥터헬기 RE0611", 0, ""}
  },
  ["렉카 헬기"] = {
    _config = {vtype = "car", blipid = 43, blipcolor = 1, radius = 5.1, permissions = {"frekcar.vehicle"}},
    ["cargobob2"] = {"카고밥", 500000000, ""},
    ["swift"] = {"스위프트 노멀", 650000000, ""},
    ["swift2"] = {"스위프트 디럭스", 820000000, ""},
    ["volatus"] = {"볼라투스 헬리콥터", 1000000000, ""}
  },
  ["헬리콥터"] = {
    _config = {vtype = "car", blipid = 43, blipcolor = 69},
    ["swift"] = {"스위프트 노멀", 650000000, ""},
    ["swift2"] = {"스위프트 디럭스", 820000000, ""},
    ["volatus"] = {"볼라투스 헬리콥터", 1000000000, ""}
  },
  ["비행기"] = {
    _config = {vtype = "car", blipid = 90, blipcolor = 69},
    ["luxor"] = {"[중형비행기] 룩소르", 2000000000, ""},
    ["miljet"] = {"[중형비행기] 밀젯", 1500000000, ""},
    ["Shamal"] = {"[중형비행기] 샤마르", 1800000000, ""},
    ["Velum"] = {"[경비행기] 베람", 500000000, ""},
    ["Duster"] = {"[경비행기] 더스터", 800000000, ""},
    ["Dodo"] = {"[경비행기] 도도", 1000000000, ""},
    ["mammatus"] = {"[경비행기] 마마타스", 400000000, ""}
  },
  ["특별한 차고"] = {
    _config = {vtype = "car", disableBuy = true},
    ["20ap0"] = {"에이펙스 AP-0 2020 하이퍼카", 0, ""},
    ["yachting"] = {"벤츠 X-Class 2020", 0, ""},
    ["trailcatcon"] = {"지프 4x4 렝글러 더티", 0, ""},
    ["hotrod2"] = {"쉐보레 핫로드 V12 1933", 0, ""},
    ["rxf7"] = {"마쯔다 RX-F7 BLS BN스포츠", 0, ""},
    ["pbus2"] = {"페스티벌 버스", 0, "🌟메차에서 뽑으면 못나가요"},
    ["dwdamas"] = {"대우 다마스", 0, ""},
    ["carnival"] = {"기아 카니발 하이리무진", 0, ""},
    ["starex"] = {"현대 스타렉스", 0, ""},
    ["g63amg6x6"] = {"벤츠 G63 AMG 6X6 흑사회에디션", 0, "🌟리얼월드 스페셜 에디션"},
    ---------------------▼ 랜덤박스 차량
    ["por356"] = {"포르쉐 356B 슈퍼 90 카브리올레 1962", 0, ""},
    ["egoista"] = {"람보르기니 에고이스타", 0, ""},
    ["raneck"] = {"랜덤 박스카", 0, ""},
    ["niroev"] = {"기아 니로 EV 2019", 0, ""},
    ["gv80"] = {"현대 제네시스 GV80", 0, ""},
    ["dn8ss"] = {"현대 쏘나타 센슈어스 2019", 0, ""},
    ["ksport"] = {"쌍용 코란도 스포츠", 0, ""},
    ["mohave"] = {"기아 모하비 2008", 0, ""},
    ["g70"] = {"현대 제네시스 G70 2019", 0, ""},
    ["nexo"] = {"현대 넥쏘 2019", 0, ""},
    ["19avante"] = {"현대 아반떼 해외수출 2019", 0, ""},
    ["k52020"] = {"기아 뉴 K5 2020", 0, ""},
    ----------------------------------------
    ["20g80"] = {"현대 제네시스 G80 2020", 0, ""},
    ["pocky"] = {"기아 스팅어 핑크 포키에디션", 0, ""},
    ["mohave20"] = {"기아 더 뉴 모하비 2020", 0, ""},
    ["sorento"] = {"기아 더 뉴 쏘렌토 2020", 0, ""},
    ---------------------▼ 랜덤박스 차량(후원)
    ["mcst"] = {"맥라렌 스피드테일", 0, ""},
    ["veneno"] = {"람보르기니 베네노", 0, ""},
    ["italigtb"] = {"이탈리아 GTB", 0, ""},
    ["vvin"] = {"볼보 2016 아이언나이트", 0, ""},
    ["exp100gt"] = {"벤틀리 EXP 100 컨셉GT 2029 8", 0, ""},
    ["600lts"] = {"멕라렌 600lt 스파이더 2020", 0, ""},
    ["huracanp"] = {"람보르기니 우라칸 풀만소리 2020", 0, ""},
    ["dvl"] = {"데빌 식스틴 프로토타입", 0, ""},
    -----------------------------------------
    ["diablous2"] = {"오프레서 NFNW", 0, ""},
    ["fordcam"] = {"포드 캠핑카 트레일러", 0, ""},
    ["turismorrod"] = {"그로티 투리스모 R 로드스터", 0, ""},
    ["mazf"] = {"마쯔다 타이키 2019 비전", 0, ""},
    ["brabhan67"] = {"F2", 0, ""},
    ["f248"] = {"페라리 F248", 0, ""},
    ["formulaA"] = {"F1", 0, ""},
    ["l78c"] = {"로터스78", 0, ""},
    ["redbullx1"] = {"레드불", 0, ""},
    ---------------------▼ 일반 차량
    ["exelero"] = {"마이바흐 엑셀레로", 0, ""},
    ["scaldarsi"] = {"마이바흐 스칼다르시", 0, ""},
    ["apollo"] = {"굼퍼트 아폴로 인텐사 이모지온", 0, ""},
    ["arrinera"] = {"아리네라 후에이라", 0, ""},
    ["regalia"] = {"쿼츠 레갈리아 723", 0, ""},
    ["ts1"] = {"젠보 TS1", 0, ""},
    ["lambf"] = {"람보르기니 셀레스티얼", 0, ""},
    ["zr"] = {"카시오 AMG 스틸 BBS", 0, ""},
    ["mbc"] = {"벤츠 AMG 프로젝트 원", 0, ""},
    ["mvisiongt"] = {"벤츠 AMG 비전GT 컨셉카", 0, ""},
    ["ltm"] = {"람보르기니 밀레니엄 3", 0, ""},
    ["fxxk"] = {"페라리 FXX K", 0, ""},
    ["f80"] = {"페라리 F80 컨셉카", 0, ""},
    ["sian2"] = {"람보르기니 시안 2020", 0, ""},
    ["avj"] = {"람보르기니 아벤타도르J 스피드스터", 0, ""},
    ["bugattila"] = {"라 부아튀르 느와르", 0, ""},
    ["bugatticentodieci"] = {"부가티 센토디에치", 0, ""},
    ["gtr2020"] = {"닛산 2020 비전 GT", 0, ""},
    ["nh2r"] = {"닌자 가와사키", 0, ""},
    ["bmm6"] = {"벤츠 마이바흐 비전 컨셉카", 0, ""},
    ["cdciel"] = {"캐딜락 씨엘", 0, ""},
    ["lamboterzom1"] = {"람보르기니 테르조 밀레니오", 0, ""},
    ["mill"] = {"핫휠 트윈 밀", 0, "🌟이벤트 차량"},
    ["250tr"] = {"페라리 르망 250TR 테르타로사 1957", 0, "🌟이벤트 차량"},
    ["18alphad"] = {"토요타 알파드 2018", 0, ""},
    ["centuria"] = {"부가티 키론 Special", 0, "🌟이벤트 차량"},
    ["ep9"] = {"NIO EP9 2017 EVO", 0, "🌟이벤트 차량"},
    ---------------------▼ 경매 차량
    ["wheelchair"] = {"휠체어", 0, ""},
    ["dawnonyx"] = {"롤스로이스 던 ONYX 백사회에디션", 0, "🌟리얼월드 2차 경매차량"},
    ["jesko2020"] = {"코닉세그 제스코 2020 X-SP", 0, "🌟리얼월드 2차 경매차량"},
    ["BMWS1000rrc"] = {"BMW S1000 rrc 2019", 0, "🌟리얼월드 2차 경매차량"},
    ["corvette"] = {"쉐보레 콜뱃 2015", 0, ""},
    ["marr"] = {"마르 데드풀 에디션", 0, ""},
    ["michelli"] = {"미셸리 스포츠 클래식", 0, ""},
    ["insurgent"] = {"경찰 인써전트", 0, ""},
    ["technical"] = {"테크니컬 전쟁 트럭1", 0, ""},
    ["technical2"] = {"테크니컬 전쟁 트럭2", 0, ""},
    ["technical3"] = {"테크니컬 전쟁 트럭3", 0, ""}
  },
  ["후원 차량"] = {
    _config = {vtype = "car", disableBuy = true},
    ["20ap0"] = {"에이펙스 AP-0 2020 하이퍼카", 0, ""},
    ["nimbus2000"] = {"마법 빗자루", 0, ""},
    ["skart"] = {"쇼핑 카트", 0, ""},
    ["superkart"] = {"슈퍼 카트", 0, ""},
    ["2018transam"] = {"트랜스 앰", 0, ""},
    ["alfieri"] = {"마세라티 알피에리 2020", 0, ""},
    ["ep9"] = {"NIO EP9 2017 EVO", 0, ""},
    ---------------------▲ 미출시
    ---------------------▼ 출시
    ["dominator5"] = {"토요타 FT-1 비전 그란투리스모 GR3", 0, "🌟 3차 랜덤상자 유니크"},
    ["bugaticento"] = {"부가티 센토디에치 2020", 0, "🌟 3차 랜덤상자 이스터에그"},
    ["RRazirrisa"] = {"롤스로이스 스페셜 리얼월드 에디션", 0, "🌟 3차 랜덤상자 레전드리"},
    ["13splimo"] = {"벤츠 스프린터 2013", 0, ""},
    --["krieger"] = {"멕라렌 스피드테일 2019", 0, ""},
    --["rancherxl"] = {"테스트 자동차 6", 0, ""},
    ["mcst"] = {"맥라렌 스피드테일", 0, ""},
    ["veneno"] = {"람보르기니 베네노", 0, ""},
    ["italigtb"] = {"이탈리아 GTB", 0, ""},
    ["vvin"] = {"볼보 2016 아이언나이트", 0, ""},
    ["exp100gt"] = {"벤틀리 EXP 100 컨셉GT 2029 8", 0, ""},
    ["600lts"] = {"멕라렌 600lt 스파이더 2020", 0, ""},
    ["huracanp"] = {"람보르기니 우라칸 풀만소리 2020", 0, ""},
    ["dvl"] = {"데빌 식스틴 프로토타입", 0, ""},
    --
    ["fxxkevo2"] = {"페라리 FXX K Evo 2020", 0, ""},
    --
    ["kart"] = {"카트", 0, ""},
    ["patty"] = {"햄버거 패티 차량", 0, ""},
    ["kaneda"] = {"카네다 오토바이", 0, ""},
    ["2018s650p"] = {"벤츠 S650 마이바흐 풀만소리 리무진", 0, ""},
    ["r1customs"] = {"리얼월드 커스텀 오토바이", 0, ""},
    ["rmodbmw"] = {"BMW M에디션 스포츠팩", 0, ""},
    ["w222emperor"] = {"마이바흐 스칼다르시 엠페러", 0, ""},
    ["granbird"] = {"기아 그랜버드 대형버스", 0, ""},
    ["greengt2h"] = {"그린GT 비전 일렉트릭 컨셉 H2 SPEED", 0, ""},
    ["chillybin"] = {"아이스 박스 카트", 0, ""}
  },
  ["낚시배"] = {
    _config = {vtype = "boat", blipid = 427, blipcolor = 5},
    ["Dinghy"] = {"딩기 구명보트", 2500000, ""},
    ["smallboat"] = {"작은 낚시배", 7000000, ""},
    ["suntrap"] = {"썬트랩 낚시배", 5000000, ""},
    ["marquis"] = {"마르퀴즈 요트", 20000000, ""},
    ["jetmax"] = {"제트맥스 보트", 25000000, ""},
    ["toro"] = {"토로 보트", 25000000, ""},
    ["tug"] = {"터그 대형 낚시배", 50000000, ""}
  },
  ["택시"] = {
    _config = {vtype = "car", permissions = {"uber.vehicle"}},
    ["taxisnt"] = {"[01] 쏘나타 뉴 라이즈 무료택시", 0, "🚖"},
    ["taxisnt2"] = {"[02] 쏘나타 뉴 라이즈 택시", 15000000, "🚖"},
    ["igtaxi"] = {"[03] 그랜저 IG 택시", 25000000, "🚖"},
    ["taxik720"] = {"[04] K7 프리미어 택시", 45000000, "🚖"},
    ["20taxi"] = {"[05] 그랜저 AG 택시", 45000000, "🚖"},
    ["20g80taxi"] = {"[06] 제네시스 G80 택시", 70000000, "🚖"}
  },
  ["환경미화원"] = {
    _config = {vtype = "car", blipid = 318, blipcolor = 4, permissions = {"trash.vehicle"}},
    ["trash"] = {"환경미화원 트럭", 0, ""}
  }
}

cfg.garage_types["일반 차고"] = {
  _config = {vtype = "car", blipid = 357, blipcolor = 69, disableBuy = true}
}
cfg.garage_types["에르지오 차고"] = {
  _config = {vtype = "car", blipid = 357, blipcolor = 69, disableBuy = true}
}
cfg.garage_types["백사회 차고"] = {
  _config = {vtype = "car", blipid = 357, blipcolor = 69, disableBuy = true}
}
cfg.garage_types["독사회 차고"] = {
  _config = {vtype = "car", blipid = 357, blipcolor = 69, disableBuy = true}
}
cfg.garage_types["흑사회 차고"] = {
  _config = {vtype = "car", blipid = 357, blipcolor = 69, disableBuy = true}
}
for k, v in pairs(cfg.garage_types) do
  if v._config and v._config.vtype then
    if v._config.vtype == "car" or v._config.vtype == "bike" then
      for k2, v2 in pairs(v) do
        if k2 ~= "_config" then
          cfg.garage_types["일반 차고"][k2] = v2
          cfg.garage_types["에르지오 차고"][k2] = v2
          cfg.garage_types["백사회 차고"][k2] = v2
          cfg.garage_types["독사회 차고"][k2] = v2
          cfg.garage_types["흑사회 차고"][k2] = v2
          cfg.garage_types["특별한 차고"][k2] = v2
          cfg.garage_types["후원 차량"][k2] = v2
        end
      end
    end
  end
end

cfg.garages = {
  {"일반 차고", -1526.7583007813, 86.413383483887, 56.575031280518, "일반 차고"}, -- 스태프
  {"일반 차고", 1803.4541015625, 2605.8864746094, 45.5595703125, "일반 차고"}, -- 감옥앞
  {"일반 차고", 401.76571655273, -1426.4812011719, 29.453905105591, "일반 차고"}, -- 부활지
  {"일반 차고", 327.98266601563, -541.78369140625, 28.744409561157, "일반 차고"}, -- EMS 사유지
  {"일반 차고", 107.99151611328, -1079.7969970703, 29.192853927612, "일반 차고"}, -- 구청
  {"일반 차고", 436.8359375, -1014.8345336914, -1328.711051940918, "일반 차고"},
  {"일반 차고", -327.47415161133, -998.30541992188, 30.385520935059, "일반 차고"},
  {"다이소직원 차고", -330.26629638672, -1006.8460083008, 30.385515213013, "다이소직원 차고"},
  {"일반 차고", -52.629463195801, -1112.4439697266, 26.43635559082, "일반 차고"},
  {"렉카 차고", -12.840730667114, -1102.4052734375, 26.672655105591, "렉카 차고"},
  {"일반 차고", 3808.0043945313, -776.26116943359, 1547.6486816406, "일반 차고"},
  {"일반 차고", 4659.7060546875, 519.11407470703, 1593.5081787109, "일반 차고"},
  {"일반 차고", -3054.7980957031, -1705.2850341797, 1521.8981933594, "일반 차고"},
  {"일반 차고", 441.66851806641, -1017.8140258789, 28.691265106201, "일반 차고"}, -- 경찰청
  --{"일반 차고", -931.10235595703, -2098.138671875, 9.2998247146606, "일반 차고"}, -- 방송국
  --{"일반 차고", -907.89404296875, -2045.0397949219, 9.2989234924316, "일반 차고"}, -- 방송국
  {"일반 차고", 1873.8165283203, 255.94638061523, 162.67932128906, "일반 차고", true},
  {"헬리콥터", 1856.935546875, 297.95516967773, 164.12948608398, "헬리콥터", true},
  ---------------------------------------
  {"경찰간부 차고", 441.84646606445, -1018.6120605469, 28.69356918335, "경찰청 고위직 차고"},
  {"경찰차", 441.8844909668, -1023.6521606445, 28.658241271973, "경찰청 차고"},
  {"경찰차", 477.92852783203, -1022.3130493164, 28.031295776367, "경찰청 차고"},
  {"경찰차", 1868.5435791016, 3696.0295410156, 33.5693359375, "경찰청 차고"}, -- sandy shores
  {"경찰차", -476.92425537109, 6026.9951171875, 31.340547561646, "경찰청 차고"}, -- paleto
  {"일반 차고", -19.27586555481, 6262.0961914063, 31.232664108276, "일반 차고"}, -- 닭공장
  {"구급차", -454.05169677734, -333.63442993164, 34.366264343262, "EMS 차고"}, --병원 응급차
  {"구급차", 337.46444702148, -571.64440917969, 28.799465179443, "EMS 차고"}, --병원 응급차
  {"구급차", 325.53918457031, -567.765625, 28.808443069458, "EMS 차고"}, --병원 응급차
  {"구급차", 293.35214233398, -610.47808837891, 43.366287231445, "EMS 차고"}, --병원 응급차
  {"구급차", 1833.3223876953, 3661.3088378906, 33.875843048096, "EMS 차고"}, -- sandy shores
  {"구급차", -255.98040771484, 6346.1127929688, 32.426189422607, "EMS 차고"}, -- paleto
  {"택시", 900.10308837891, -186.19523620605, 73.794876098633, "택시 차고"}, -- jobs garage
  {"택시", -28.014577865601, -1678.3653564453, 29.482383728027, "택시 차고"}, -- jobs garage
  {"낚시배", 3843.3933105469, 4444.8271484375, 0.26559686660767, "보트 차고"},
  {"낚시배", -1817.5894775391, -976.87622070313, 0.77369791269302, "보트 차고"},
  {"경찰보트", -1822.9376220703, -965.79888916016, 0.5876921415329, "경찰 보트 차고"},
  {"경찰보트", 3879.1862792969, 4424.2329101563, 0.66670858860016, "경찰 보트 차고"},
  ---------------------------------------
  --{"방송국헬리콥터", -920.39392089844, -2074.9497070313, 9.2989273071289, "헬리콥터"},
  ---------------------------------------
  {"현대/기아", 230.49008178711, -807.26403808594, 30.480003356934, "현대/기아"},
  {"도요타/렉서스", 232.23974609375, -802.23559570313, 30.501386642456, "도요타/렉서스"},
  {"BMW/미니", 234.91226196289, -794.88189697266, 30.532760620117, "BMW/미니"},
  {"벤츠", 236.99235534668, -789.68621826172, 30.549201965332, "벤츠"},
  {"아우디/폭스바겐", 239.80238342285, -782.09515380859, 30.61696434021, "아우디/폭스바겐"},
  {"벤틀리", 241.6925201416, -777.09765625, 30.661417007446, "벤틀리"},
  {"맥라렌", 234.47747802734, -774.39038085938, 30.731399536133, "맥라렌"},
  {"포르쉐", 232.73405456543, -779.31475830078, 30.697372436523, "포르쉐"},
  {"페라리", 230.03303527832, -787.02075195313, 30.672172546387, "페라리"},
  {"람보르기니", 228.10397338867, -792.28582763672, 30.650018692017, "람보르기니"},
  {"재규어", 224.95953369141, -799.64166259766, 30.642181396484, "재규어"},
  {"기타", 223.37457275391, -804.46307373047, 30.64838218689, "기타"},
  {"포드/캐딜락/닷지", 215.14477539063, -800.8720703125, 30.818689346313, "포드/캐딜락/닷지"},
  {"혼다", 216.57511901855, -796.42327880859, 30.802080154419, "혼다"},
  {"롤스로이스", 219.69232177734, -788.58471679688, 30.785417556763, "롤스로이스"},
  {"테슬라", 221.65995788574, -783.60083007813, 30.776359558105, "테슬라"},
  {"쉐보레", 224.23394775391, -775.69213867188, 30.784782409668, "쉐보레"},
  {"마세라티", 225.93601989746, -770.96185302734, 30.788383483887, "마세라티"},
  {"애스턴마틴", 219.42263793945, -769.27868652344, 30.812343597412, "애스턴마틴"},
  {"닛산", 217.77868652344, -774.11328125, 30.819946289063, "닛산"},
  {"볼보", 214.9900970459, -781.86096191406, 30.841915130615, "볼보"},
  {"랜드로버", 213.11306762695, -786.93664550781, 30.864585876465, "랜드로버"},
  {"헤네시", 243.75067138672, -771.74102783203, 30.722299575806, "헤네시"},
  {"바이크", 210.31979370117, -794.43121337891, 30.918321609497, "바이크"},
  {"자전거", 208.71995544434, -799.33154296875, 30.95337677002, "자전거"},
  {"부가티", 244.61541748047, -744.24987792969, 34.6, "부가티"},
  {"파가니", 247.97834777832, -745.41906738281, 34.6, "파가니"},
  {"W모터스", 251.38139343262, -746.44384765625, 34.6, "W모터스"},
  {"코닉세그", 254.51989746094, -747.70758056641, 34.6, "코닉세그"},
  ------------------------------------------------------
  {"페라리", -468.28109741211, -618.27392578125, 31.250009536743, "페라리"},
  {"페라리", -464.78457641602, -618.07037353516, 31.257953643799, "페라리"},
  {"페라리", -461.0126953125, -618.22039794922, 31.250011444092, "페라리"},
  {"페라리", -457.36502075195, -618.24566650391, 31.249990463257, "페라리"},
  -------------------------------------------------------
  {"관리자 차량", -2604.03125, 1677.9565429688, 141.86471557617, "관리자 차고"},
  -------------------------------------------------------
  {"트럭 차고", 30.986246109009, -2493.4118652344, 6.0064167976379, "트럭 차고"},
  -------------------------------------------------------
  {"백사회 차고", -124.89235687256, 1001.8675537109, 235.72866821289, "백사회 차고"}, -- 백사회
  {"독사회 차고", -1543.2512207031, 885.38006591797, 181.40533447266, "독사회 차고"}, -- 독사회
  {"헬리콥터", -112.92272186279, 960.51879882813, 234.41020202637, "헬리콥터"}, -- 백사회
  {"헬리콥터", -1520.4549560547, 802.56634521484, 181.89289855957, "헬리콥터"}, -- 백사회
  {"흑사회 차고", 1422.2755126953, 1119.1040039063, 114.64739227295, "흑사회 차고"}, -- 흑사회
  {"헬리콥터", 1449.6500244141, 1111.8002929688, 116.17409515381, "헬리콥터"}, -- 흑사회 1
  {"헬리콥터", 1469.8558349609, 1111.6417236328, 116.17440795898, "헬리콥터"}, -- 흑사회 2
  {"일반 차고", 883.5722, -5.2346, 78.7640, "일반 차고"}, -- 카지노
  {"헬리콥터", -75.166984558105, -819.22839355469, 326.17544555664, "헬리콥터 - 안전착지"}, -- 메이즈 헬리콥터
  {"헬리콥터", -144.69148254395, -593.59887695313, 211.77517700195, "헬리콥터 - 안전착지"}, -- 아카디어스 헬리콥터
  {"헬리콥터", -724.83093261719, -1444.0892333984, 5.0005207061768, "헬리콥터 - 안전착지"}, -- 해변가
  --{"헬리콥터", 1874.1932373047, 283.84478759766, 164.30531311035, "헬리콥터 - 안전착지"}, -- 벙커
  {"헬리콥터", 2839.8198242188, -755.71124267578, 17.019071578979, "헬리콥터 - 안전착지"}, -- 서부 리조트1
  --{"헬리콥터", -2647.0229492188, 1362.2762451172, 141.6337890625, "헬리콥터 - 안전착지"}, -- 에르지오 헬기
  {"렉카 헬기", -49.647289276123, -1094.6778564453, 45.7373046875, "헬리콥터 - 안전착지"}, -- 뉴 에르지오 헬기
  {"헬리콥터", -5855.7099609375, 1212.2247314453, 5.8401560783386, "헬리콥터 - 안전착지"}, -- Villa Island
  {"경찰 헬기", 1770.2171630859, 3239.5561523438, 42.13171005249, "헬리콥터 - 안전착지"}, -- Sandy Shores
  {"경찰 헬기", -475.24264526367, 5988.7353515625, 31.336685180664, "헬리콥터 - 안전착지"}, -- Paleto Bay
  {"EMS 헬기", 449.30340576172, -981.24963378906, 43.69165802002, "헬리콥터 - 안전착지"}, -- Main PD
  {"EMS 헬기", 351.76412963867, -588.08129882813, 74.165641784668, "헬리콥터 - 안전착지"}, -- 병원 옥상
  {"EMS 헬기", 1770.2171630859, 3239.5561523438, 42.13171005249, "헬리콥터 - 안전착지"}, -- Sandy Shores
  {"EMS 헬기", -475.24264526367, 5988.7353515625, 31.336685180664, "헬리콥터 - 안전착지"}, -- Paleto Bay
  {"경찰 헬기", 481.74465942383, -982.31597900391, 41.00806427002, "헬리콥터 - 안전착지"}, -- Paleto Bay
  {"교정본부 헬기", 1873.1494140625, 2592.2543945313, 45.672370910645, "헬리콥터 - 안전착지"}, -- 교정본부 교도소앞
  {"비행기", 2128.9069824219, 4806.134765625, 41.168750762939, "비행기 - 안전착지"}, -- 북부 활주로
  {"비행기", -1458.1787109375, -2736.9533691406, 13.944939613342, "비행기 - 안전착지"}, -- 공항(남부)
  {"비행기", 1734.9053955078, 3297.9689941406, 41.223503112793, "비행기 - 안전착지"}, -- 북부 활주로
  {"비행기", -2006.6853027344, 2857.99609375, 32.879837036133, "비행기 - 안전착지"}, -- 공항(군사기지)
  {"헬리콥터", -964.7659277344, -2983.884609375, 13.95015789032, "헬리콥터 - 안전착지"},
  {"헬리콥터", -745.14343261719, -1468.5361328125, 5.0005240440369, "헬리콥터 - 안전착지"},
  {"교정본부차고", 1692.4865722656, 2604.4990234375, 45.564888000488, "교정본부 차고"},
  {"환경미화원", -616.26354980469, -1601.6033935547, 26.750917434692, "환경미화원 차고"}
}

return cfg
