local cfg = {}

-- define market types like garages and weapons
-- _config: blipid, blipcolor, permissions (optional, only users with the permission will have access to the market)

cfg.market_types = {
  ["클럽"] = {
    _config = {blipid = 52, blipcolor = 2},
    -- list itemid => price
    -- Drinks
    ["absol"] = 34000,
    ["dom"] = 84000,
    ["armand"] = 170000,
    ["xrated"] = 40000
  },
  ["도미노"] = {
    _config = {blipid = 52, blipcolor = 2},
    ["pizza"] = 10500,
    ["cocacola"] = 1900
  },
  ["곡괭이"] = {
    _config = {permissions = {"miner.market"}},
    ["picareta"] = 10000
  },
  ["에르지오 특별상점"] = {
    _config = {permissions = {"erjio.market"}},
    ["supressor"] = 120000,
    ["grip"] = 50000,
    ["body_armor"] = 500000,
    ["yusuf"] = 2500,
    ["holografik"] = 200000,
    ["jtj7"] = 500,
    ["hd5"] = 500,
    ["powiekszonymagazynek"] = 500000
  },
  ["특별 수리 키트"] = {
    _config = {permissions = {"crownmember"}},
    ["hwrepairkit"] = 2000000
  },
  ["렉카 수리 키트"] = {
    _config = {permissions = {"frrepairkit"}},
    ["fr_repairkit"] = 1000000
  },  
  ["다이소 특별상점"] = {
    _config = {permissions = {"daiso.market"}},
    ["picareta"] = 100,
    ["ks3"] = 100,
    ["sk3"] = 100,
    ["fl3"] = 100,
    ["c4_box1"] = 5000,
    --["smg_mk2_t"] = 500,
    --["ak47_mk2_t"] = 700,
    --["shotgun_mk2_t"] = 300,
    --["ak47_3"] = 500,
    --["smg_3"] = 1000,
    --["shotgun_3"] = 500,
    ["supressor"] = 60000,
    ["grip"] = 25000,
    ["body_armor"] = 150000,
    ["yusuf"] = 1500,
    ["holografik"] = 100000,
    ["jtj7"] = 500,
    ["hd5"] = 500,
    ["lockpick"] = 500000,
    ["powiekszonymagazynek"] = 250000
  },
  ["조직 MK2 상점"] = {
    _config = {permissions = {"mk2w.a1"}},
    ["smg_mk2_t"] = 50000,
    ["ak47_mk2_t"] = 70000,
    ["shotgun_mk2_t"] = 30000,
    ["ak47_3"] = 5000,
    ["smg_3"] = 1000,
    ["shotgun_3"] = 5000,
  },
  ["경찰 방탄복"] = {
    _config = {permissions = {"policebts.market"}},
    ["body_armor"] = 150000
  },  
  ["리얼일레븐"] = {
    _config = {blipid = 52, blipcolor = 2},
    -- list itemid => price
    -- Drinks
    ["milk"] = 1150,
    ["water"] = 1000,
    ["coffee"] = 1500,
    ["repairkit"] = 100000,
    ["titlebox_return"] = 500000,
    ["skinbox_return"] = 50000000,
    ["maskbox_return"] = 25000000,
    ["tea"] = 2100,
    ["icetea"] = 1900,
    ["orangejuice"] = 2180,
    ["cocacola"] = 1900,
    ["redbull"] = 5200,
    ["lemonade"] = 1700,
    ["kanari"] = 4150,
    ["ramen"] = 5500,
    ["icecream"] = 1500,
    ["vodka"] = 23150,
    --리얼일레븐
    ["bread"] = 4300,
    ["pizza"] = 10500,
    ["donut"] = 6000,
    ["tacos"] = 4100,
    ["sandwich"] = 4350,
    ["kebab"] = 3300,
    ["pdonut"] = 12000,
    ["tofu"] = 2400,
    ["cigar1"] = 4700,
    ["cigar2"] = 5000,
    ["metaldetector"] = 250000,
    ["skinbox_return"] = 50000000,
    ["BombRecipe"] = 1000000,
    ["maskbox_return"] = 25000000
  },
  ["해제키트"] = {
    _config = {blipid = 52, blipcolor = 5},
    ["titlebox_return"] = 500000,
    ["skinbox_return"] = 50000000,
    ["maskbox_return"] = 25000000
  },
  ["의료국"] = {
    _config = {blipid = 51, blipcolor = 68, permissions = {"emergency.market"}},
    ["medkit"] = 5000
  },
  ["마약원재료"] = {
    _config = {blipid = 473, blipcolor = 4, permissions = {"drugseller.market"}},
    ["seeds"] = 500,
    ["benzoyl"] = 800,
    ["harness"] = 1000
  },
  ["대마씨"] = {
    _config = {blipid = 473, blipcolor = 4, permissions = {"drug.gang"}},
    ["seeds"] = 500
  },  
  ["벤조일"] = {
    _config = {blipid = 473, blipcolor = 4, permissions = {"drug.gang"}},
    ["benzoyl"] = 1000
  },    
  ["LSD원료"] = {
    _config = {blipid = 473, blipcolor = 4, permissions = {"drug.gang"}},
    ["harness"] = 1500
  },     
  ["저격총 상점"] = {
    _config = {blipid = 473, blipcolor = 4, permissions = {"mk2w.a2"}},
    ["sniper_m"] = 100000000
  },
  ["저격 탄약 상점"] = {
    _config = {blipid = 473, blipcolor = 4, permissions = {"mk2w.a2"}},
    ["sniper_t"] = 5000000
  },
  ["총기 상점"] = {
    _config = {blipid = 473, blipcolor = 4, permissions = {"mk2w.a1"}},
    ["pistol_m"] = 100000,
    ["ak47_m"] = 300000,
    ["smg_m"] = 300000,
    ["shotgun_m"] = 200000
  },
  ["탄약 상점"] = {
    _config = {blipid = 473, blipcolor = 4, permissions = {"mk2w.a1"}},
    ["pistol_t"] = 50000,
    ["ak47_t"] = 100000,
    ["smg_t"] = 100000,
    ["shotgun_t"] = 50000
  },
  ["카지노칩"] = {
    _config = {permissions = {"casinotoken.market"}},
    ["real_chip_n"] = 100000
  },
  ["우유박스"] = {
    _config = {permissions = {"milk.market"}},
    ["garrafa_vazia"] = 5000
  },
  ["수리키트"] = {
    _config = {blipid = 402, blipcolor = 47, permissions = {"repair.market"}},
    ["repairkit"] = 100000
  },
  ["휴대폰마켓"] = {
    _config = {},
    ["phone_1"] = 1500000,
    ["phone_2"] = 2500000,
    ["laptop_h"] = 3000000
  }
}

-- list of markets {type,x,y,z}

cfg.markets = {
  --{"카지노칩", 262.26919555664, -824.20623779297, 29.437816619873, "카지노 칩 상점"},
  {"휴대폰마켓", 262.26919555664, -824.20623779297, 29.437816619873, "휴대폰 마켓"},
  {"휴대폰마켓", -2223.7687988281, 261.99392700195, 174.60670471191, "휴대폰 마켓"},
  {"해제키트", 183.703125, -946.8203125, 30.09189414978, "해제 키트"},
  {"클럽", 177.87924194336, -905.19158935547, 31.028461456299, ""},
  {"다이소 특별상점", -346.83798217773, -978.61267089844, 36.749977111816, "다이소 특별상점"},
  {"조직 MK2 상점", -98.95743560791,999.46337890625,235.77839660645, "조직 MK2 상점"},
  {"조직 MK2 상점", 1403.6625976563,1149.7451171875,114.33354949951, "조직 MK2 상점"},
  {"조직 MK2 상점", -1526.1302490234,848.44580078125,181.59463500977, "조직 MK2 상점"},
  --{"에르지오 특별상점", -2674.0844726563, 1305.8013916016, 152.01371765137, "에르지오 특별상점"},
  {"클럽", -1393.3287353516, -608.26470947266, 30.319570541382},
  {"클럽", 937.50231933594, 12.198595046997, 75.491317749023, "클럽"}, -- 카지노
  {"클럽", 971.88513183594, 48.846588134766, 74.991264343262, "클럽"}, -- 카지노
 -- {"카지노칩", 1114.8493652344, 243.87174987793, -45.840980529785, "카지노칩 구매"},
  {"곡괭이", 2944.3237304688, 2742.8527832031, 43.369033813477, "곡괭이 구매"},
  {"총기 상점", -91.832664489746, 993.96667480469, 234.60194396973, "총기 상점"}, -- 백사회
  {"탄약 상점", -91.680328369141, 995.69604492188, 234.60194396973, "탄약 상점"}, -- 백사회
  {"총기 상점", 1403.7225341797, 1145.4169921875, 114.33351135254, "총기 상점"}, -- 흑사회
  {"탄약 상점", 1406.740234375, 1159.7950439453, 114.33345794678, "탄약 상점"}, -- 흑사회
  {"총기 상점", -1514.9398193359,839.70764160156,186.14179992676, "총기 상점"}, -- 독사회
  {"탄약 상점", -1512.7830810547, 840.90118408203, 186.14179992676, "탄약 상점"}, -- 독사회
  {"저격 탄약 상점", 844.43255615234, -1027.4759521484, 28.194843292236, "탄약 상점"}, -- 경찰,조직 공용
  {"저격총 상점", 844.57287597656, -1029.5474853516, 28.194858551025, "탄약 상점"}, -- 경찰,조직 공용
  {"경찰 방탄복", 450.18798828125, -973.46154785156, 30.689723968506, "방탄복 구매"},
  {"리얼일레븐", 89.050590515137, -1947.8897705078, 20.74388885498, "음식 구매"}, --ufc
  {"도미노", 92.20539855957, -1952.8070068359, 20.742511749268, "음식 구매"}, --ufc
  {"리얼일레븐", 128.1410369873, -1286.1120605469, 29.281036376953, "음식 구매"},
  {"리얼일레븐", 904.80346679688, -3204.33203125, -97.187965393066, "음식 구매"},
  {"리얼일레븐", -5865.8100585938, 1158.9962158203, 8.0000047683716, "음식 구매"},
  {"리얼일레븐", -47.522762298584, -1756.85717773438, 29.4210109710693, "음식 구매"},
  {"리얼일레븐", 25.7454013824463, -1345.26232910156, 29.4970207214355, "음식 구매"},
  {"리얼일레븐", 1135.57678222656, -981.78125, 46.4157981872559, "음식 구매"},
  {"리얼일레븐", -1064.2752685547, -244.32000732422, 39.733184814453, "음식 구매"},
  {"리얼일레븐", 1163.53820800781, -323.541320800781, 69.2050552368164, "음식 구매"},
  {"리얼일레븐", 374.190032958984, 327.506713867188, 103.566368103027, "음식 구매"},
  {"리얼일레븐", 2555.35766601563, 382.16845703125, 108.622947692871, "음식 구매"},
  {"리얼일레븐", 2676.76733398438, 3281.57788085938, 55.2411231994629, "음식 구매"},
  {"리얼일레븐", 1960.50793457031, 3741.84008789063, 32.3437385559082, "음식 구매"},
  {"리얼일레븐", 1393.23828125, 3605.171875, 34.9809303283691, "음식 구매"},
  {"리얼일레븐", 1166.18151855469, 2709.35327148438, 38.15771484375, "음식 구매"},
  {"리얼일레븐", 1107.46, 208.57, -49.44, "음식 구매"},
  {"리얼일레븐", 945.62, 16.86, 116.16, "음식 구매"},
  {"리얼일레븐", 547.987609863281, 2669.7568359375, 42.1565132141113, "음식 구매"},
  {"리얼일레븐", 1698.30737304688, 4924.37939453125, 42.0636749267578, "음식 구매"},
  {"리얼일레븐", 1729.54443359375, 6415.76513671875, 35.0372200012207, "음식 구매"},
  {"리얼일레븐", -3243.9013671875, 1001.40405273438, 12.8307056427002, "음식 구매"},
  {"리얼일레븐", -2967.8818359375, 390.78662109375, 15.0433149337769, "음식 구매"},
  {"리얼일레븐", -3041.17456054688, 585.166198730469, 7.90893363952637, "음식 구매"},
  {"리얼일레븐", -1820.55725097656, 792.770568847656, 138.113250732422, "음식 구매"},
  {"리얼일레븐", -1486.76574707031, -379.553985595703, 40.163387298584, "음식 구매"},
  {"리얼일레븐", -1223.18127441406, -907.385681152344, 12.3263463973999, "음식 구매"},
  {"리얼일레븐", -707.408996582031, -913.681701660156, 19.2155857086182, "음식 구매"},
  {"리얼일레븐", 2859.2648925781, -751.68994140625, 6.5430846214294, "음식 구매"},
  {"특별 수리 키트", 195.40715026855, -996.38543701172, 30.091842651367, "특별 수리키트"},
  {"렉카 수리 키트", -43.603351593018, -1094.755859375, 26.45440864563, "수리키트"},
  {"의료국", 337.88928222656, -586.1005859375, 28.898626327515},
  {"수리키트", 408.95471191406, -1622.8607177734, 29.291942596436},
  {"우유박스", 260.14181518555, -823.23956298828, 29.437795639038, "우유박스 구매"},
  {"리얼일레븐", -2283.3435058594, 362.91857910156, 174.60176086426, "음식 구매"}, -- 뉴비월드
  {"리얼일레븐", -2240.9233398438, 275.59796142578, 174.60179138184, "음식 구매"}, -- 뉴비월드
  {"리얼일레븐", 313.12661743164, -588.50708007813, 43.292797088623, "음식 구매"}, -- EMS
  {"리얼일레븐", 321.93090820313, -599.54461669922, 43.292804718018, "음식 구매"}, -- EMS
  {"리얼일레븐", 344.42282104492, -595.03521728516, 43.281620025635, "음식 구매"}, -- EMS
  {"카지노칩", 961.57153320313, 23.449354171753, 76.991264343262, "카지노칩 구매"}, -- 카지노칩
  {"벤조일", -508.99615478516,5339.4560546875,74.103637695313, ""}, -- 벤조일 구매
  {"대마씨", -552.22283935547,5328.1088867188,73.639236450195  , ""}, -- 대마씨 구매
  {"LSD원료", -579.54235839844,5361.4912109375,70.245750427246, ""} -- LSD 원료 구매
}
return cfg
