--[[
    bScript™ vrp_ptracking (https://www.bareungak.com/)
    
    Sort : Configuration
	Version : 1.00

    Author : Bareungak (https://steamcommunity.com/id/Bareungak)
]]

--[[

    LICENSE (EN)

    Licenses are provided in a leased form to the licensed purchaser and under no circumstances can be transferred to another person.

    Seller and developer shall not be liable for any legal indemnity if the licensed purchaser cancels the licence in violation of the terms and conditions.

    In the event of property damage to the developer or seller caused by a significant event in connection with the license, 
    the developer or seller shall claim damages and be designated as a competent court near the developer or seller's location in the event of a lawsuit.

    The terms and conditions take effect after the corresponding script is applied.

]]

--[[

    라이선스 (KO)

    허가된 구매자에게 라이선스를 임대형식으로 제공하며 어떠한 경우에도 타인에게 라이선스를 양도 할 수 없다.

    허가된 구매자가 해당 약관을 위반하여 라이선스가 취소되는 경우 판매자와 개발자는 그 어떤 법적 배상의 책임을 지지 않는다.

    라이선스와 관련하여 중대한 사건으로 인해 개발자 또는 판매자에게 재산상의 손해이 발생한 경우
    개발자 또는 판매자는 해당 구매자에게 손해배상을 청구하고, 소송시 개발자 또는 판매자 소재지 근처의 관할 법원으로 지정한다.

    해당 스크립트를 적용한 이후 부터 해당 약관의 효력이 발생한다.

]]

--[[

    구매자 :
    UID :
    구매 일시 :

    에게 임대 형식으로 라이선스를 적용하며, 약관 위반사항 또는 라이선스와 관련하여 중대한 사건 발생으로 인해 
    개발자 판매자에게 재산상의 손해가 발생한 경우 구매자가 전적으로 책임지며, 라이선스는 취소되 해당 에드온을 사용할 수 없다.

]]

cfg = {}

--   ________   ________  _____ ______   _______           ________  _______  _________  _________  ___  ________   ________     
--  |\   ___  \|\   __  \|\   _ \  _   \|\  ___ \         |\   ____\|\  ___ \|\___   ___\\___   ___\\  \|\   ___  \|\   ____\    
--  \ \  \\ \  \ \  \|\  \ \  \\\__\ \  \ \   __/|        \ \  \___|\ \   __/\|___ \  \_\|___ \  \_\ \  \ \  \\ \  \ \  \___|    
--   \ \  \\ \  \ \   __  \ \  \\|__| \  \ \  \_|/__       \ \_____  \ \  \_|/__  \ \  \     \ \  \ \ \  \ \  \\ \  \ \  \  ___  
--    \ \  \\ \  \ \  \ \  \ \  \    \ \  \ \  \_|\ \       \|____|\  \ \  \_|\ \  \ \  \     \ \  \ \ \  \ \  \\ \  \ \  \|\  \ 
--     \ \__\\ \__\ \__\ \__\ \__\    \ \__\ \_______\        ____\_\  \ \_______\  \ \__\     \ \__\ \ \__\ \__\\ \__\ \_______\
--      \|__| \|__|\|__|\|__|\|__|     \|__|\|_______|       |\_________\|_______|   \|__|      \|__|  \|__|\|__| \|__|\|_______|
--                                                           \|_________|



-- 서버 네트워크 이름 (예: 바른각 네트워크)

cfg.networkname = "리얼월드 네트워크"

-- 1번 프로그램 이름 (예: 바른각_로그뷰어.exe)

cfg.program1name = "리얼월드_로그뷰어.exe"

-- 2번 프로그램 이름 (예: 경찰청_추적시스템.exe)

cfg.program2name = "경찰청_추적시스템.exe"



--   ________  ________  ___  ___  ___       _______  _________  _________  _______           ________  _______  _________  _________  ___  ________   ________     
--  |\   __  \|\   __  \|\  \|\  \|\  \     |\  ___ \|\___   ___\\___   ___\\  ___ \         |\   ____\|\  ___ \|\___   ___\\___   ___\\  \|\   ___  \|\   ____\    
--  \ \  \|\  \ \  \|\  \ \  \\\  \ \  \    \ \   __/\|___ \  \_\|___ \  \_\ \   __/|        \ \  \___|\ \   __/\|___ \  \_\|___ \  \_\ \  \ \  \\ \  \ \  \___|    
--   \ \   _  _\ \  \\\  \ \  \\\  \ \  \    \ \  \_|/__  \ \  \     \ \  \ \ \  \_|/__       \ \_____  \ \  \_|/__  \ \  \     \ \  \ \ \  \ \  \\ \  \ \  \  ___  
--    \ \  \\  \\ \  \\\  \ \  \\\  \ \  \____\ \  \_|\ \  \ \  \     \ \  \ \ \  \_|\ \       \|____|\  \ \  \_|\ \  \ \  \     \ \  \ \ \  \ \  \\ \  \ \  \|\  \ 
--     \ \__\\ _\\ \_______\ \_______\ \_______\ \_______\  \ \__\     \ \__\ \ \_______\        ____\_\  \ \_______\  \ \__\     \ \__\ \ \__\ \__\\ \__\ \_______\
--      \|__|\|__|\|_______|\|_______|\|_______|\|_______|   \|__|      \|__|  \|_______|       |\_________\|_______|   \|__|      \|__|  \|__|\|__| \|__|\|_______|
--                                                                                              \|_________|



-- 룰렛 글자 (영문 8자)

cfg.words = {
    "REALREAL",
    "BLINBLIN",
    "MACMACMA",
    "ACCOLADE",
    "ROULETTE",
    "EASYLIFE"
}

-- 룰렛 맞추기 n번 틀리면 실패 트리거 발동

cfg.lives = 5

-- 전체 룰렛 속도 (math.random n ~ n 랜덤 속도 조절)

cfg.speed = math.random(40,240)


--   _________  ________  ________  ________  ___  __    ___  ________   ________          ________  _______  _________  _________  ___  ________   ________     
--  |\___   ___\\   __  \|\   __  \|\   ____\|\  \|\  \ |\  \|\   ___  \|\   ____\        |\   ____\|\  ___ \|\___   ___\\___   ___\\  \|\   ___  \|\   ____\    
--  \|___ \  \_\ \  \|\  \ \  \|\  \ \  \___|\ \  \/  /|\ \  \ \  \\ \  \ \  \___|        \ \  \___|\ \   __/\|___ \  \_\|___ \  \_\ \  \ \  \\ \  \ \  \___|    
--       \ \  \ \ \   _  _\ \   __  \ \  \    \ \   ___  \ \  \ \  \\ \  \ \  \  ___       \ \_____  \ \  \_|/__  \ \  \     \ \  \ \ \  \ \  \\ \  \ \  \  ___  
--        \ \  \ \ \  \\  \\ \  \ \  \ \  \____\ \  \\ \  \ \  \ \  \\ \  \ \  \|\  \       \|____|\  \ \  \_|\ \  \ \  \     \ \  \ \ \  \ \  \\ \  \ \  \|\  \ 
--         \ \__\ \ \__\\ _\\ \__\ \__\ \_______\ \__\\ \__\ \__\ \__\\ \__\ \_______\        ____\_\  \ \_______\  \ \__\     \ \__\ \ \__\ \__\\ \__\ \_______\
--          \|__|  \|__|\|__|\|__|\|__|\|_______|\|__| \|__|\|__|\|__| \|__|\|_______|       |\_________\|_______|   \|__|      \|__|  \|__|\|__| \|__|\|_______|
--                                                                                           \|_________|                                                                                                                                                            



-- 추적 권한 (vRP 그룹)

cfg.trackingpermission = "police_ch.pc"

-- 상대방 추적 메세지 활성화 여부 (true, false)

cfg.tracking = true

-- 상대방 추적 메세지 (~r~ = 빨간색)

cfg.trackingmessage = "~o~[안내]~w~ 누군가가 당신을 추적 중입니다!"

-- 추적자 맵 표시 이름

cfg.blipname = "추적자"

-- 추적 완료 메세지 (~g~ = 초록색)

cfg.successmessage = "~g~[안내]~w~ 위치가 표시되었습니다!"

-- 추적 완료 후 n 밀리초 후 삭제
cfg.removesec = 30000

-- 추적 완료 후 n 밀리초 전 삭제 메세지

cfg.removemessage = "~r~ 30초뒤 추적자 아이콘이 삭제됩니다!"