---------------------------------------------------------
-------------- VRP Names, RealWorld MAC -----------------
-------------- https://discord.gg/realw -----------------
---------------------------------------------------------

icons = {
    ["person"] = "👱",
    ["newbie"] = "🌱",
    ["ems"] = "🚑",
    ["cop"] = "👮🏻",
    ["uber"] = "🚖",
    ["repair"] = "🔧",
    ["shh"] = "⚔",
    ["mafia"] = "💀",
    ["dok"] = "🔪",
    ["gm"] = "🚧",
    ["tow"] = "⛄",
    ["cbs"] = "📷",
    ["kys"] = "👔",
    ["helper"] = "🐥",
    ["inspector"] = "🔰",
    ["admin"] = "🌟",
    ["subae"] = "👥"
}
-- ID,파일명,x,y,z,가로,세로,회전,R,G,B,알파
custom_icons = {
    {"nameicon.admin1", "nameicon.admin1", 0.0, 0.0, 1.35, 0.26, 0.22, 0.0, 255, 255, 255, 255},
    {"nameicon.admin2", "nameicon.admin2", 0.0, 0.0, 1.38, 0.34, 0.18, 0.0, 255, 255, 255, 255},
    {"nameicon.admin3", "nameicon.admin3", 0.0, 0.0, 1.35, 0.26, 0.22, 0.0, 255, 255, 255, 255},
    {"nameicon.helper1", "nameicon.helper1", 0.0, 0.0, 1.35, 0.32, 0.18, 0.0, 255, 255, 255, 255},
    --{"title.supporter1", "title.supporter1", 0.0, 0.0, 1.35, 0.06, 0.12, 0.0, 255, 255, 255, 255},
    {"nameicon.yh", "nameicon.yh", 0.0, 0.0, 1.32, 0.18, 0.12, 0.0, 255, 255, 255, 255},
    {"nameicon.hy", "nameicon.hy", 0.0, 0.0, 1.32, 0.18, 0.12, 0.0, 255, 255, 255, 255},
    {"nameicon.bl", "nameicon.bl", 0.0, 0.0, 1.32, 0.18, 0.12, 0.0, 255, 255, 255, 255},
    {"nameicon.lj", "nameicon.lj", 0.0, 0.0, 1.32, 0.18, 0.12, 0.0, 255, 255, 255, 255},
    {"nameicon.ad", "nameicon.ad", 0.0, 0.0, 1.32, 0.18, 0.12, 0.0, 255, 255, 255, 255},
    {"nameicon.god", "nameicon.god", 0.0, 0.0, 1.32, 0.18, 0.12, 0.0, 255, 255, 255, 255},
    {"redmember", "redmember", 0.0, 0.0, 1.36, 0.26, 0.21, 0.0, 255, 255, 255, 255},
    {"acemember", "acemember", 0.0, 0.0, 1.36, 0.26, 0.23, 0.0, 255, 255, 255, 255},
    {"royalmember", "royalmember", 0.0, 0.0, 1.36, 0.26, 0.23, 0.0, 255, 255, 255, 255},
    {"noblemember", "noblemembers", 0.0, 0.0, 1.36, 0.26, 0.23, 0.0, 255, 255, 255, 255},
    {"firstmember", "firstmember", 0.0, 0.0, 1.40, 0.26, 0.26, 0.0, 255, 255, 255, 255},
    {"firstfmember", "firstfmember", 0.0, 0.0, 1.40, 0.26, 0.26, 0.0, 255, 255, 255, 255},
    {"trinitymember", "trinitymember", 0.0, 0.0, 1.40, 0.26, 0.26, 0.0, 255, 255, 255, 255},
    {"crownmember", "crownmembers", 0.0, 0.0, 1.40, 0.26, 0.26, 0.0, 255, 255, 255, 255},
    {"prestigemember", "prestigemember", 0.0, 0.0, 1.32, 0.18, 0.12, 0.0, 255, 255, 255, 255},
    {"highendmember", "highendmember", 0.0, 0.0, 1.40, 0.26, 0.26, 0.0, 255, 255, 255, 255},
    {"nameicon.moderator", "nameicon.moderator", 0.0, 0.0, 1.32, 0.18, 0.12, 0.0, 255, 255, 255, 255}
}
